// 试题 A: 消消乐乐
// 本题总分：5 分
// 【问题描述】
// 小苯在玩一个简化版的三消小游戏。
// 棋盘有 5 行 5 列，每个格子里恰好有一个方块，颜色只可能是 R、G、B 三种之一，
// 分别表示红、绿、蓝。
// 当前棋盘如下：
// R R G R G
// G R R R R
// G G R R G
// B R G R B
// R B G G G
// 游戏规则如下：
// • 在某一轮中，如果一段连续方块颜色相同，且它们在同一行或同一列，并且长度
// 至少为 3，那么这段方块中的所有格子都会被标记。
// • 一轮中，所有被标记的格子会同时消除。
// • 如果某个格子同时属于横向和纵向的可消除连续段，它也只会被消除一次。
// • 一轮消除结束后，每一列中剩余的方块都会下落，填补这一列中的空位。
// • 然后继续重复上述过程，直到棋盘上再也无法发生消除为止。
// 你的任务就是求出：当游戏最终停止时，棋盘上还剩多少个方块。
#include<iostream>
using namespace std;
int main ()
{
    cout<<12;
    return 0;
}
